# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Dropbox\Team Awesomeness Awesome\RS232\Test232485.cydsn\Test232485.cyprj
# Date: Mon, 09 Mar 2015 08:19:48 GMT
#set_units -time ns
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 53 105} -nominal_period 2166.6666666666665 [list [get_pins {ClockBlock/udb_div_0}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]


# Component constraints for D:\Dropbox\Team Awesomeness Awesome\RS232\Test232485.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Dropbox\Team Awesomeness Awesome\RS232\Test232485.cydsn\Test232485.cyprj
# Date: Mon, 09 Mar 2015 08:19:41 GMT
